<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Subsetting-and-Descriptive-Stats" data-toc-modified-id="Subsetting-and-Descriptive-Stats-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Subsetting and Descriptive Stats</a></span><ul class="toc-item"><li><span><a href="#Before-your-start:" data-toc-modified-id="Before-your-start:-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Before your start:</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Import-all-the-necessary-libraries-here:" data-toc-modified-id="Import-all-the-necessary-libraries-here:-1.1.0.1"><span class="toc-item-num">1.1.0.1&nbsp;&nbsp;</span>Import all the necessary libraries here:</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-1" data-toc-modified-id="Challenge-1-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Challenge 1</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#In-this-challenge-we-will-use-the-temp_states--dataset." data-toc-modified-id="In-this-challenge-we-will-use-the-temp_states--dataset.-2.0.0.1"><span class="toc-item-num">2.0.0.1&nbsp;&nbsp;</span>In this challenge we will use the <code>temp_states</code>  dataset.</a></span></li><li><span><a href="#First-import-it-into-a-dataframe-called-temp." data-toc-modified-id="First-import-it-into-a-dataframe-called-temp.-2.0.0.2"><span class="toc-item-num">2.0.0.2&nbsp;&nbsp;</span>First import it into a dataframe called <code>temp</code>.</a></span></li><li><span><a href="#Print-temp." data-toc-modified-id="Print-temp.-2.0.0.3"><span class="toc-item-num">2.0.0.3&nbsp;&nbsp;</span>Print <code>temp</code>.</a></span></li><li><span><a href="#Explore-the-data-types-of-the-temp-dataframe.-What-types-of-data-do-we-have?-Comment-your-result." data-toc-modified-id="Explore-the-data-types-of-the-temp-dataframe.-What-types-of-data-do-we-have?-Comment-your-result.-2.0.0.4"><span class="toc-item-num">2.0.0.4&nbsp;&nbsp;</span>Explore the data types of the <em>temp</em> dataframe. What types of data do we have? Comment your result.</a></span></li><li><span><a href="#Select-the-rows-where-state-is-New-York." data-toc-modified-id="Select-the-rows-where-state-is-New-York.-2.0.0.5"><span class="toc-item-num">2.0.0.5&nbsp;&nbsp;</span>Select the rows where state is New York.</a></span></li><li><span><a href="#What-is-the-average-temperature-of-cities-in-New-York?" data-toc-modified-id="What-is-the-average-temperature-of-cities-in-New-York?-2.0.0.6"><span class="toc-item-num">2.0.0.6&nbsp;&nbsp;</span>What is the average temperature of cities in New York?</a></span></li><li><span><a href="#Which-states-and-cities-have-a-temperature-above-15-degrees-Celsius?" data-toc-modified-id="Which-states-and-cities-have-a-temperature-above-15-degrees-Celsius?-2.0.0.7"><span class="toc-item-num">2.0.0.7&nbsp;&nbsp;</span>Which states and cities have a temperature above 15 degrees Celsius?</a></span></li><li><span><a href="#Now,-return-only-the-cities-that-have-a-temperature-above-15-degrees-Celsius." data-toc-modified-id="Now,-return-only-the-cities-that-have-a-temperature-above-15-degrees-Celsius.-2.0.0.8"><span class="toc-item-num">2.0.0.8&nbsp;&nbsp;</span>Now, return only the cities that have a temperature above 15 degrees Celsius.</a></span></li><li><span><a href="#Which-cities-have-a-temperature-above-15-degrees-Celcius-and-below-20-degrees-Celsius?" data-toc-modified-id="Which-cities-have-a-temperature-above-15-degrees-Celcius-and-below-20-degrees-Celsius?-2.0.0.9"><span class="toc-item-num">2.0.0.9&nbsp;&nbsp;</span>Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?</a></span></li><li><span><a href="#Find-the-mean-and-standard-deviation-of-the-temperature-of-each-state." data-toc-modified-id="Find-the-mean-and-standard-deviation-of-the-temperature-of-each-state.-2.0.0.10"><span class="toc-item-num">2.0.0.10&nbsp;&nbsp;</span>Find the mean and standard deviation of the temperature of each state.</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-2" data-toc-modified-id="Challenge-2-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Challenge 2</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Load-the-employees-dataset-into-a-dataframe.-Call-the-dataframe-employees." data-toc-modified-id="Load-the-employees-dataset-into-a-dataframe.-Call-the-dataframe-employees.-3.0.0.1"><span class="toc-item-num">3.0.0.1&nbsp;&nbsp;</span>Load the <code>employees</code> dataset into a dataframe. Call the dataframe <code>employees</code>.</a></span></li><li><span><a href="#Explore-the-data-types-of-the-employees-dataframe.-Comment-your-results." data-toc-modified-id="Explore-the-data-types-of-the-employees-dataframe.-Comment-your-results.-3.0.0.2"><span class="toc-item-num">3.0.0.2&nbsp;&nbsp;</span>Explore the data types of the <code>employees</code> dataframe. Comment your results.</a></span></li><li><span><a href="#What's-the-average-salary-in-this-company?" data-toc-modified-id="What's-the-average-salary-in-this-company?-3.0.0.3"><span class="toc-item-num">3.0.0.3&nbsp;&nbsp;</span>What's the average salary in this company?</a></span></li><li><span><a href="#What's-the-highest-salary?" data-toc-modified-id="What's-the-highest-salary?-3.0.0.4"><span class="toc-item-num">3.0.0.4&nbsp;&nbsp;</span>What's the highest salary?</a></span></li><li><span><a href="#What's-the-lowest-salary?" data-toc-modified-id="What's-the-lowest-salary?-3.0.0.5"><span class="toc-item-num">3.0.0.5&nbsp;&nbsp;</span>What's the lowest salary?</a></span></li><li><span><a href="#Who-are-the-employees-with-the-lowest-salary?" data-toc-modified-id="Who-are-the-employees-with-the-lowest-salary?-3.0.0.6"><span class="toc-item-num">3.0.0.6&nbsp;&nbsp;</span>Who are the employees with the lowest salary?</a></span></li><li><span><a href="#Find-all-the-information-about-an-employee-called-David." data-toc-modified-id="Find-all-the-information-about-an-employee-called-David.-3.0.0.7"><span class="toc-item-num">3.0.0.7&nbsp;&nbsp;</span>Find all the information about an employee called David.</a></span></li><li><span><a href="#Could-you-return-only-David's-salary?" data-toc-modified-id="Could-you-return-only-David's-salary?-3.0.0.8"><span class="toc-item-num">3.0.0.8&nbsp;&nbsp;</span>Could you return only David's salary?</a></span></li><li><span><a href="#Print-all-the-rows-where-job-title-is-associate." data-toc-modified-id="Print-all-the-rows-where-job-title-is-associate.-3.0.0.9"><span class="toc-item-num">3.0.0.9&nbsp;&nbsp;</span>Print all the rows where job title is associate.</a></span></li><li><span><a href="#Print-the-first-3-rows-of-your-dataframe." data-toc-modified-id="Print-the-first-3-rows-of-your-dataframe.-3.0.0.10"><span class="toc-item-num">3.0.0.10&nbsp;&nbsp;</span>Print the first 3 rows of your dataframe.</a></span></li><li><span><a href="#Find-the-employees-whose-title-is-associate-and-whose-salary-is-above-55." data-toc-modified-id="Find-the-employees-whose-title-is-associate-and-whose-salary-is-above-55.-3.0.0.11"><span class="toc-item-num">3.0.0.11&nbsp;&nbsp;</span>Find the employees whose title is associate and whose salary is above 55.</a></span></li><li><span><a href="#Group-the-employees-by-number-of-years-of-employment.-What-are-the-average-salaries-in-each-group?" data-toc-modified-id="Group-the-employees-by-number-of-years-of-employment.-What-are-the-average-salaries-in-each-group?-3.0.0.12"><span class="toc-item-num">3.0.0.12&nbsp;&nbsp;</span>Group the employees by number of years of employment. What are the average salaries in each group?</a></span></li><li><span><a href="#What-is-the-average-salary-per-title?" data-toc-modified-id="What-is-the-average-salary-per-title?-3.0.0.13"><span class="toc-item-num">3.0.0.13&nbsp;&nbsp;</span>What is the average salary per title?</a></span></li><li><span><a href="#Find-the-salary-quartiles." data-toc-modified-id="Find-the-salary-quartiles.-3.0.0.14"><span class="toc-item-num">3.0.0.14&nbsp;&nbsp;</span>Find the salary quartiles.</a></span></li><li><span><a href="#Is-the-mean-salary-different-per-gender?" data-toc-modified-id="Is-the-mean-salary-different-per-gender?-3.0.0.15"><span class="toc-item-num">3.0.0.15&nbsp;&nbsp;</span>Is the mean salary different per gender?</a></span></li><li><span><a href="#Find-the-minimum,-mean-and-maximum-of-all-numeric-columns-for-each-company-department." data-toc-modified-id="Find-the-minimum,-mean-and-maximum-of-all-numeric-columns-for-each-company-department.-3.0.0.16"><span class="toc-item-num">3.0.0.16&nbsp;&nbsp;</span>Find the minimum, mean and maximum of all numeric columns for each company department.</a></span></li><li><span><a href="#Bonus-Question:--for-each-department,-compute-the-difference-between-the-maximum-and-the-minimum-salary." data-toc-modified-id="Bonus-Question:--for-each-department,-compute-the-difference-between-the-maximum-and-the-minimum-salary.-3.0.0.17"><span class="toc-item-num">3.0.0.17&nbsp;&nbsp;</span>Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Challenge-3" data-toc-modified-id="Challenge-3-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Challenge 3</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Open-the-orders-dataset.-Name-your-dataset-orders." data-toc-modified-id="Open-the-orders-dataset.-Name-your-dataset-orders.-4.0.0.1"><span class="toc-item-num">4.0.0.1&nbsp;&nbsp;</span>Open the <code>orders</code> dataset. Name your dataset <code>orders</code>.</a></span></li><li><span><a href="#Explore-your-dataset-by-looking-at-the-data-types-and-summary-statistics.-Comment-your-results." data-toc-modified-id="Explore-your-dataset-by-looking-at-the-data-types-and-summary-statistics.-Comment-your-results.-4.0.0.2"><span class="toc-item-num">4.0.0.2&nbsp;&nbsp;</span>Explore your dataset by looking at the data types and summary statistics. Comment your results.</a></span></li><li><span><a href="#What-is-the-average-purchase-price?" data-toc-modified-id="What-is-the-average-purchase-price?-4.0.0.3"><span class="toc-item-num">4.0.0.3&nbsp;&nbsp;</span>What is the average purchase price?</a></span></li><li><span><a href="#What-are-the-highest-and-lowest-purchase-prices?" data-toc-modified-id="What-are-the-highest-and-lowest-purchase-prices?-4.0.0.4"><span class="toc-item-num">4.0.0.4&nbsp;&nbsp;</span>What are the highest and lowest purchase prices?</a></span></li><li><span><a href="#Select-all-the-customers-from-Spain." data-toc-modified-id="Select-all-the-customers-from-Spain.-4.0.0.5"><span class="toc-item-num">4.0.0.5&nbsp;&nbsp;</span>Select all the customers from Spain.</a></span></li><li><span><a href="#How-many-customers-do-we-have-in-Spain?" data-toc-modified-id="How-many-customers-do-we-have-in-Spain?-4.0.0.6"><span class="toc-item-num">4.0.0.6&nbsp;&nbsp;</span>How many customers do we have in Spain?</a></span></li><li><span><a href="#Select-all-the-customers-who-have-bought-more-than-50-items." data-toc-modified-id="Select-all-the-customers-who-have-bought-more-than-50-items.-4.0.0.7"><span class="toc-item-num">4.0.0.7&nbsp;&nbsp;</span>Select all the customers who have bought more than 50 items.</a></span></li><li><span><a href="#Select-orders-from-Spain-that-include-more-than-50-items." data-toc-modified-id="Select-orders-from-Spain-that-include-more-than-50-items.-4.0.0.8"><span class="toc-item-num">4.0.0.8&nbsp;&nbsp;</span>Select orders from Spain that include more than 50 items.</a></span></li><li><span><a href="#Select-all-free-orders." data-toc-modified-id="Select-all-free-orders.-4.0.0.9"><span class="toc-item-num">4.0.0.9&nbsp;&nbsp;</span>Select all free orders.</a></span></li><li><span><a href="#Select-all-orders-whose-description-starts-with-lunch-bag." data-toc-modified-id="Select-all-orders-whose-description-starts-with-lunch-bag.-4.0.0.10"><span class="toc-item-num">4.0.0.10&nbsp;&nbsp;</span>Select all orders whose description starts with <code>lunch bag</code>.</a></span></li><li><span><a href="#Select-all-lunch-bag-orders-made-in-2011." data-toc-modified-id="Select-all-lunch-bag-orders-made-in-2011.-4.0.0.11"><span class="toc-item-num">4.0.0.11&nbsp;&nbsp;</span>Select all <code>lunch bag</code> orders made in 2011.</a></span></li><li><span><a href="#Show-the-frequency-distribution-of-the-amount-spent-in-Spain." data-toc-modified-id="Show-the-frequency-distribution-of-the-amount-spent-in-Spain.-4.0.0.12"><span class="toc-item-num">4.0.0.12&nbsp;&nbsp;</span>Show the frequency distribution of the amount spent in Spain.</a></span></li><li><span><a href="#Select-all-orders-made-in-the-month-of-August." data-toc-modified-id="Select-all-orders-made-in-the-month-of-August.-4.0.0.13"><span class="toc-item-num">4.0.0.13&nbsp;&nbsp;</span>Select all orders made in the month of August.</a></span></li><li><span><a href="#Find-the-number-of-orders-made-by-each-country-in-the-month-of-August." data-toc-modified-id="Find-the-number-of-orders-made-by-each-country-in-the-month-of-August.-4.0.0.14"><span class="toc-item-num">4.0.0.14&nbsp;&nbsp;</span>Find the number of orders made by each country in the month of August.</a></span></li><li><span><a href="#What's-the--average-amount-of-money-spent-by-country?" data-toc-modified-id="What's-the--average-amount-of-money-spent-by-country?-4.0.0.15"><span class="toc-item-num">4.0.0.15&nbsp;&nbsp;</span>What's the  average amount of money spent by country?</a></span></li><li><span><a href="#What's-the-most-expensive-item?" data-toc-modified-id="What's-the-most-expensive-item?-4.0.0.16"><span class="toc-item-num">4.0.0.16&nbsp;&nbsp;</span>What's the most expensive item?</a></span></li><li><span><a href="#What-is-the-average-amount-spent-per-year?" data-toc-modified-id="What-is-the-average-amount-spent-per-year?-4.0.0.17"><span class="toc-item-num">4.0.0.17&nbsp;&nbsp;</span>What is the average amount spent per year?</a></span></li></ul></li></ul></li></ul></li></ul></div>

# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd

# Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
temp = pd.read_csv('temp_states.txt')

#### Print `temp`.

In [3]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

We have 2 objects and one float.

#### Select the rows where state is New York.

In [5]:
ny = temp.loc[temp['State'] == 'New York']
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [6]:
temp.loc[temp['State']=='New York'].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [7]:
temp.loc[temp['Temperature']>15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [8]:
temp['City'].loc[temp['Temperature']<15]

1        Albany
2       Buffalo
4    Bridgeport
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [9]:
temp['City'].loc[((temp['Temperature']>15) & (temp['Temperature']<20))]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [10]:
group_temp = temp.groupby("State")
mean_state = group_temp.mean()
mean_state = mean_state.reset_index()
mean_state

         State  Temperature
0  Connecticut    15.833333
1   New Jersey    21.111111
2     New York    10.740741

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [11]:
employees = pd.read_csv('employee.txt')
employees.head(5)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the `employees` dataframe. Comment your results.

In [12]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

5 objects and 2 integer

#### What's the average salary in this company?

In [13]:
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [14]:
employees['Salary'].max()

70

#### What's the lowest salary?

In [15]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [16]:
employees.sort_values('Salary').head(5)

     Name Department Education Gender      Title  Years  Salary
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
0    Jose         IT  Bachelor      M    analyst      1      35
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Find all the information about an employee called David.

In [17]:
employees.loc[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [18]:
employees['Salary'].loc[employees['Name']=='David']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [19]:
employees.loc[employees['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [20]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [21]:
# Method 2
employees.loc[employees.index<3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [22]:
employees.loc[((employees['Title']== 'associate') & (employees['Salary']>55))]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [23]:
group_emp = employees.groupby("Years")
mean_emp = group_emp.mean()
mean_emp = mean_emp.reset_index()
mean_emp

   Years     Salary
0      1  35.000000
1      2  38.333333
2      3  55.000000
3      4  35.000000
4      7  60.000000
5      8  70.000000

####  What is the average salary per title?

In [24]:
group_emp = employees.groupby("Title")
mean_emp = group_emp.mean()
mean_emp = mean_emp.reset_index()
mean_emp

       Title  Years     Salary
0         VP   8.00  70.000000
1    analyst   2.25  32.500000
2  associate   4.00  56.666667

####  Find the salary quartiles.

In [25]:
employees.Salary.quantile([0.25,0.5,0.75])

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [26]:
group_emp = employees.groupby("Gender")
mean_emp = group_emp.mean()
mean_emp = mean_emp.reset_index()
mean_emp

  Gender  Years  Salary
0      F    4.0    47.5
1      M    4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [27]:
group_emp = employees.groupby('Department')
group_emp.describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [33]:
new_emp = employees.groupby('Department').agg(
            Diff=pd.NamedAgg(column='Salary', aggfunc=lambda x: x.max() - x.min()),)
new_emp

            Diff
Department
HR            40
IT            40
Sales          0

# Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [38]:
orders = pd.read_csv('orders.txt')
orders.head(5)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [39]:
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [40]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In this dataframe has a lot of numeric columns, but most of them are year, month, day and hour. Also we need to drop the 'Unnamed:0' column (it's a index). 

Only the columns quantity, unit price and amount_spent should be analyzed using the summary statistics.

Normally unit price and amount_spent can't be equal to zero, need to understand this values.

####  What is the average purchase price?

In [42]:
orders['amount_spent'].mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [44]:
print('Max purchase price is :',orders['amount_spent'].max(),'. And the min purchase prise is:', orders['amount_spent'].min())

Max purchase price is : 168469.6 . And the min purchase prise is: 0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [54]:
orders_spain = orders.loc[orders['Country']=='Spain']
orders_spain['CustomerID'].unique()

array([12557, 17097, 12540, 12551, 12484, 12539, 12510, 12421, 12502,
       12462, 12507, 12541, 12547, 12597, 12545, 12596, 12354, 12417,
       12455, 12450, 12548, 12556, 12550, 12546, 12454, 12448, 12544,
       12538, 12445, 12442], dtype=int64)

#### How many customers do we have in Spain?

In [56]:
list_spain = orders_spain['CustomerID'].unique()
len(list_spain)

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [79]:
group_cust=orders.groupby('CustomerID').sum()
group_cust.loc[group_cust['Quantity']>50].sort_values('Quantity', ascending=False)

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
14646,544561120,1163267611,4182810,14191,6552,24488,197491,5176.09,280206.02
16446,929130,1688629,6033,22,11,27,80997,4.98,168472.50
14911,1737367680,3196374868,11416155,46220,18930,68148,80515,26185.72,143825.06
12415,164201777,398543981,1439876,4254,2169,8061,77670,2097.08,124914.53
12346,61619,541431,2011,1,2,10,74215,1.04,77183.60
...,...,...,...,...,...,...,...,...,...
14768,1649991,2827432,10055,43,18,64,52,19.55,192.60
14890,985061,3839213,14077,21,28,77,51,20.35,125.65
15350,6585,2682670,10050,60,15,65,51,13.35,115.65
15748,8958348,12040560,42231,210,147,252,51,78.46,149.31
12587,2080586,2321060,8044,48,20,48,51,46.24,144.00

#### Select orders from Spain that include more than 50 items.

In [87]:
orders_spain.loc[orders_spain['Quantity']>50].sort_values('Quantity')

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4252,6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
224881,315702,564734,84826,2011,8,7,13,asstd design 3d paper stickers,60,2011-08-28 13:32:00,0.85,12484,Spain,51.00
4250,6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4253,6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
366327,495740,578321,84997B,2011,11,3,16,childrens cutlery retrospot red,72,2011-11-23 16:59:00,3.75,12557,Spain,270.00
312657,426667,573362,22599,2011,10,7,13,christmas musical zinc star,72,2011-10-30 13:06:00,0.29,12597,Spain,20.88
312656,426666,573362,22597,2011,10,7,13,musical zinc heart decoration,72,2011-10-30 13:06:00,0.29,12597,Spain,20.88
312655,426665,573362,22598,2011,10,7,13,christmas musical zinc tree,72,2011-10-30 13:06:00,0.29,12597,Spain,20.88
289134,398631,571255,82482,2011,10,5,17,wooden picture frame white finish,72,2011-10-14 17:13:00,2.55,12454,Spain,183.60
289129,398626,571255,82494L,2011,10,5,17,wooden frame antique white,72,2011-10-14 17:13:00,2.55,12454,Spain,183.60
174446,248801,558871,84997B,2011,7,1,13,childrens cutlery retrospot red,72,2011-07-04 13:19:00,3.75,12557,Spain,270.00
174449,248804,558871,84997A,2011,7,1,13,childrens cutlery polkadot green,72,2011-07-04 13:19:00,3.75,12557,Spain,270.00
295956,407272,571851,23167,2011,10,3,13,small ceramic top storage jar,96,2011-10-19 13:02:00,0.69,12596,Spain,66.24
254097,355752,567968,85204,2011,9,5,9,hanging wood and felt flower,96,2011-09-23 09:44:00,0.12,12546,Spain,11.52
174442,248797,558871,22384,2011,7,1,13,lunch bag pink polkadot,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
174443,248798,558871,20727,2011,7,1,13,lunch bag black skull.,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
174444,248799,558871,20725,2011,7,1,13,lunch bag red retrospot,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
174445,248800,558871,20728,2011,7,1,13,lunch bag cars blue,100,2011-07-04 13:19:00,1.45,12557,Spain,145.00
4251,6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
4254,6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
197167,282906,561669,23295,2011,7,4,17,set of 12 mini loaf baking cases,128,2011-07-28 17:09:00,0.72,12507,Spain,92.16
197169,282908,561669,23294,2011,7,4,17,set of 6 snack loaf baking cases,128,2011-07-28 17:09:00,0.72,12507,Spain,92.16
197170,282909,561669,23296,2011,7,4,17,set of 6 tea time baking cases,128,2011-07-28 17:09:00,1.04,12507,Spain,133.12
197171,282910,561669,23293,2011,7,4,17,set of 12 fairy cake baking cases,128,2011-07-28 17:09:00,0.72,12507,Spain,92.16
32454,52416,540785,84997B,2011,1,2,11,red 3 piece retrospot cutlery set,144,2011-01-11 11:39:00,3.39,12557,Spain,488.16
197168,282907,561669,23297,2011,7,4,17,set 40 heart shape petit four cases,144,2011-07-28 17:09:00,1.45,12507,Spain,208.80
32457,52419,540785,84997A,2011,1,2,11,green 3 piece polkadot cutlery set,144,2011-01-11 11:39:00,3.39,12557,Spain,488.16
91155,136767,547972,22383,2011,3,1,16,lunch bag suki design,150,2011-03-28 16:41:00,1.45,12557,Spain,217.50
91156,136768,547972,22384,2011,3,1,16,lunch bag pink polkadot,150,2011-03-28 16:41:00,1.45,12557,Spain,217.50
91159,136771,547972,20728,2011,3,1,16,lunch bag cars blue,150,2011-03-28 16:41:00,1.45,12557,Spain,217.50
289142,398639,571255,72802B,2011,10,5,17,ocean scent candle in jewelled box,200,2011-10-14 17:13:00,1.25,12454,Spain,250.00
366326,495739,578321,20728,2011,11,3,16,lunch bag cars blue,200,2011-11-23 16:59:00,1.45,12557,Spain,290.00
289143,398640,571255,72802C,2011,10,5,17,vanilla scent candle jewelled box,288,2011-10-14 17:13:00,1.25,12454,Spain,360.00
366329,495742,578321,84997C,2011,11,3,16,childrens cutlery polkadot blue,288,2011-11-23 16:59:00,3.75,12557,Spain,1080.00
32456,52418,540785,84997C,2011,1,2,11,blue 3 piece polkadot cutlery set,360,2011-01-11 11:39:00,3.39,12557,Spain,1220.40
366328,495741,578321,84997D,2011,11,3,16,childrens cutlery polkadot pink,360,2011-11-23 16:59:00,3.75,12557,Spain,1350.00
32455,52417,540785,84997D,2011,1,2,11,pink 3 piece polkadot cutlery set,360,2011-01-11 11:39:00,3.39,12557,Spain,1220.40
174448,248803,558871,84997C,2011,7,1,13,childrens cutlery polkadot blue,360,2011-07-04 13:19:00,3.75,12557,Spain,1350.00
174447,248802,558871,84997D,2011,7,1,13,childrens cutlery polkadot pink,360,2011-07-04 13:19:00,3.75,12557,Spain,1350.00

#### Select all free orders.

In [104]:
orders.loc[orders['amount_spent']==0.0]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
6914,9302,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Germany,0.0
22539,33576,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,United Kingdom,0.0
25379,40089,539722,22423,2010,12,2,13,regency cakestand 3 tier,10,2010-12-21 13:45:00,0.0,14911,EIRE,0.0
29080,47068,540372,22090,2011,1,4,16,paper bunting retrospot,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
29082,47070,540372,22553,2011,1,4,16,plasters in tin skulls,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
34494,56674,541109,22168,2011,1,4,15,organiser wood antique white,1,2011-01-13 15:10:00,0.0,15107,United Kingdom,0.0
53788,86789,543599,84535B,2011,2,4,13,fairy cakes notebook a6 size,16,2011-02-10 13:08:00,0.0,17560,United Kingdom,0.0
85671,130188,547417,22062,2011,3,3,10,ceramic bowl with love heart design,36,2011-03-23 10:25:00,0.0,13239,United Kingdom,0.0
92875,139453,548318,22055,2011,3,3,12,mini cake stand hanging strawbery,5,2011-03-30 12:45:00,0.0,13113,United Kingdom,0.0
97430,145208,548871,22162,2011,4,1,14,heart garland rustic padded,2,2011-04-04 14:42:00,0.0,14410,United Kingdom,0.0
107192,157042,550188,22636,2011,4,4,18,childs breakfast set circus parade,1,2011-04-14 18:57:00,0.0,12457,Switzerland,0.0
128641,187613,553000,47566,2011,5,4,15,party bunting,4,2011-05-12 15:21:00,0.0,17667,United Kingdom,0.0
137127,198383,554037,22619,2011,5,5,14,set of 6 soldier skittles,80,2011-05-20 14:13:00,0.0,12415,Australia,0.0
194648,279324,561284,22167,2011,7,2,12,oval wall mirror diamante,1,2011-07-26 12:24:00,0.0,16818,United Kingdom,0.0
197173,282912,561669,22960,2011,7,4,17,jam making set with jars,11,2011-07-28 17:09:00,0.0,12507,Spain,0.0
199711,285657,561916,M,2011,8,1,11,manual,1,2011-08-01 11:44:00,0.0,15581,United Kingdom,0.0
208950,298054,562973,23157,2011,8,4,11,set of 6 nativity magnets,240,2011-08-11 11:42:00,0.0,14911,EIRE,0.0
223931,314745,564651,23270,2011,8,5,14,set of 2 ceramic painted hearts,96,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223932,314746,564651,23268,2011,8,5,14,set of 2 ceramic christmas reindeer,192,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223933,314747,564651,22955,2011,8,5,14,36 foil star cake cases,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223934,314748,564651,21786,2011,8,5,14,polkadot rain hat,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
256263,358655,568158,PADS,2011,9,7,12,pads to match all cushions,1,2011-09-25 12:22:00,0.0,16133,United Kingdom,0.0
259399,361825,568384,M,2011,9,2,9,manual,1,2011-09-27 09:46:00,0.0,12748,United Kingdom,0.0
273926,379913,569716,22778,2011,10,4,8,glass cloche small,2,2011-10-06 08:17:00,0.0,15804,United Kingdom,0.0
286507,395529,571035,M,2011,10,4,12,manual,1,2011-10-13 12:50:00,0.0,12446,RSA,0.0
307092,420404,572893,21208,2011,10,3,14,pastel colour honeycomb fan,5,2011-10-26 14:36:00,0.0,18059,United Kingdom,0.0
319882,436428,574138,23234,2011,11,4,11,biscuit tin vintage christmas,216,2011-11-03 11:26:00,0.0,12415,Australia,0.0
320049,436597,574175,22065,2011,11,4,11,christmas pudding trinket pot,12,2011-11-03 11:47:00,0.0,14110,United Kingdom,0.0
320407,436961,574252,M,2011,11,4,13,manual,1,2011-11-03 13:24:00,0.0,12437,France,0.0
322279,439361,574469,22385,2011,11,5,11,jumbo bag spaceboy design,12,2011-11-04 11:55:00,0.0,12431,Australia,0.0
328385,446125,574879,22625,2011,11,1,13,red kitchen scales,2,2011-11-07 13:22:00,0.0,13014,United Kingdom,0.0
329006,446793,574920,22899,2011,11,1,16,children's apron dolly girl,1,2011-11-07 16:34:00,0.0,13985,United Kingdom,0.0
329007,446794,574920,23480,2011,11,1,16,mini lights woodland mushrooms,1,2011-11-07 16:34:00,0.0,13985,United Kingdom,0.0
334242,454463,575579,22437,2011,11,4,11,set of 9 black skull balloons,20,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
334243,454464,575579,22089,2011,11,4,11,paper bunting vintage paisley,24,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
352746,479079,577129,22464,2011,11,4,19,hanging metal heart lantern,4,2011-11-17 19:52:00,0.0,15602,United Kingdom,0.0
353097,479546,577168,M,2011,11,5,10,manual,1,2011-11-18 10:42:00,0.0,12603,Germany,0.0
354170,480649,577314,23407,2011,11,5,13,set of 2 trays home sweet home,2,2011-11-18 13:23:00,0.0,12444,Norway,0.0
358629,485985,577696,M,2011,11,1,11,manual,1,2011-11-21 11:57:00,0.0,16406,United Kingdom,0.0
370473,502122,578841,84826,2011,11,5,15,asstd design 3d paper stickers,12540,2011-11-25 15:57:00,0.0,13256,United Kingdom,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [108]:
orders.loc[orders['Description']=='%lunch bag']

Empty DataFrame
Columns: [Unnamed: 0, InvoiceNo, StockCode, year, month, day, hour, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, amount_spent]
Index: []

In [123]:
x= orders[orders['Description'].str.contains('lunch bag', na = False)]
x

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,174,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,363,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,368,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,369,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Select all `lunch bag` orders made in 2011.

In [125]:
x.loc[x['year']==2011]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,42678,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,42679,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,42851,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,42852,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,43616,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Show the frequency distribution of the amount spent in Spain.

In [136]:
orders_spain['amount_spent'].value_counts().head(10)

15.00    186
17.70    122
19.80     99
17.40     86
10.20     76
30.00     59
14.85     56
16.50     56
12.60     50
10.50     43
Name: amount_spent, dtype: int64

#### Select all orders made in the month of August.

In [139]:
y= orders.loc[orders['month']==8]
y

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
199475,285421,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,285422,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,285423,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,285424,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,285425,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
226483,320688,565067,22644,2011,8,3,17,ceramic cherry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226484,320689,565067,22645,2011,8,3,17,ceramic heart fairy cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226485,320690,565067,22637,2011,8,3,17,piggy bank retrospot,2,2011-08-31 17:16:00,2.55,15856,United Kingdom,5.10
226486,320691,565067,22646,2011,8,3,17,ceramic strawberry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226487,320692,565067,22741,2011,8,3,17,funky diva pen,48,2011-08-31 17:16:00,0.85,15856,United Kingdom,40.80

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [146]:
y['Country'].value_counts()

United Kingdom     23105
Germany              795
EIRE                 593
France               569
Netherlands          280
Switzerland          267
Spain                252
Belgium              194
Israel               171
Channel Islands      140
Australia            107
Italy                 95
Austria               88
Norway                77
Finland               61
Malta                 55
Portugal              41
Sweden                40
Unspecified           23
Iceland               22
Poland                17
Denmark               16
Canada                 5
Name: Country, dtype: int64

#### What's the  average amount of money spent by country?

In [156]:
group_y=orders.groupby('Country').mean()
group_y['amount_spent'].sort_values(ascending=False)

Country
Netherlands             120.798282
Australia               116.895620
Japan                   116.561900
Singapore                95.852658
Sweden                   85.096075
Denmark                  49.882474
Lithuania                47.458857
Lebanon                  37.641778
EIRE                     36.687745
Brazil                   35.737500
Norway                   33.736418
Czech Republic           33.069600
Finland                  32.913985
Greece                   32.831172
Bahrain                  32.258824
Switzerland              30.642752
Israel                   29.119718
United Arab Emirates     27.974706
Channel Islands          27.340160
Austria                  25.624824
Germany                  25.311562
France                   25.056827
Spain                    24.779521
Malta                    24.335625
Canada                   24.280662
Iceland                  23.681319
Italy                    23.064960
Portugal                 22.872702
Poland                   22.226212
Cyprus                   22.134169
European Community       21.670833
United Kingdom           20.625073
Belgium                  20.283772
USA                      20.002179
RSA                      17.281207
Saudi Arabia             16.213333
Unspecified              10.930615
Name: amount_spent, dtype: float64

#### What's the most expensive item?

In [160]:
orders.loc[orders['UnitPrice']==(orders['UnitPrice'].max())]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
118352,173382,551697,POST,2011,5,2,13,postage,1,2011-05-03 13:46:00,8142.75,16029,United Kingdom,8142.75

#### What is the average amount spent per year?

In [162]:
avg_year=orders.groupby('year').mean()
avg_year['amount_spent']

year
2010    21.892733
2011    22.430074
Name: amount_spent, dtype: float64